Ran Plan for project: `nas.techtales.io` dir: `terraform/nas.techtales.io` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.bucket_policies["policy_alex_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/alex/*",
            ]
        }
    }

  # module.bucket_policies["policy_alex_backup"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "alex-backup"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:*",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::backup/alex/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_alex_backup"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "alex-backup"
+       user_name   = "alex"
    }

  # module.bucket_policies["policy_cnpg-nas_cnpg"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::cnpg/nas/*",
            ]
        }
    }

  # module.bucket_policies["policy_dominik_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/dominik/*",
            ]
        }
    }

  # module.bucket_policies["policy_dominik_backup"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "dominik-backup"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:*",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::backup/dominik/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_dominik_backup"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "dominik-backup"
+       user_name   = "dominik"
    }

  # module.bucket_policies["policy_jasmin_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/jasmin/*",
            ]
        }
    }

  # module.bucket_policies["policy_jasmin_backup"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "jasmin-backup"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:*",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::backup/jasmin/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_jasmin_backup"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "jasmin-backup"
+       user_name   = "jasmin"
    }

  # module.bucket_policies["policy_nils_backup"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::backup/nils/*",
            ]
        }
    }

  # module.bucket_policies["policy_nils_backup"].minio_iam_policy.main will be created
+ resource "minio_iam_policy" "main" {
+       id     = (known after apply)
+       name   = "nils-backup"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "s3:*",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::backup/nils/*",
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.bucket_policies["policy_nils_backup"].minio_iam_user_policy_attachment.main will be created
+ resource "minio_iam_user_policy_attachment" "main" {
+       id          = (known after apply)
+       policy_name = "nils-backup"
+       user_name   = "nils"
    }

  # module.bucket_policies["policy_terraform-discord_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/discord/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-minio_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/minio/nas.techtales.io/*",
            ]
        }
    }

  # module.bucket_policies["policy_terraform-openbao_terraform"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::terraform/openbao/techtales.io/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-kube-lab_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/kube-lab/*",
            ]
        }
    }

  # module.bucket_policies["policy_volsync-nas_volsync"].data.minio_iam_policy_document.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "minio_iam_policy_document" "main" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "s3:*",
            ]
+           resources = [
+               "arn:aws:s3:::volsync/nas/*",
            ]
        }
    }

  # module.buckets["backup"].minio_s3_bucket.main will be created
+ resource "minio_s3_bucket" "main" {
+       acl                = "private"
+       arn                = (known after apply)
+       bucket             = "backup"
+       bucket_domain_name = (known after apply)
+       force_destroy      = false
+       id                 = (known after apply)
+       object_locking     = false
    }

  # module.users["alex"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "alex"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["alex"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/alex"
    }

  # module.users["dominik"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "dominik"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["dominik"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/dominik"
    }

  # module.users["jasmin"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "jasmin"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["jasmin"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/jasmin"
    }

  # module.users["nils"].minio_iam_user.main will be created
+ resource "minio_iam_user" "main" {
+       disable_user  = false
+       force_destroy = false
+       id            = (known after apply)
+       name          = "nils"
+       secret        = (sensitive value)
+       status        = (known after apply)
+       tags          = {
+           "managed-by" = "terraform"
        }
+       update_secret = false
    }

  # module.users["nils"].vault_generic_secret.minio_secret will be created
+ resource "vault_generic_secret" "minio_secret" {
+       data                = (sensitive value)
+       data_json           = (sensitive value)
+       delete_all_versions = false
+       disable_read        = false
+       id                  = (known after apply)
+       path                = "infra/minio/iam/nas.techtales.io/nils"
    }

Plan: 17 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p nas.techtales.io
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-techtales-io-terraform-minio.techtales.io/lock?id=techtales-io%252Fterraform-minio%252Fterraform%252Fnas.techtales.io%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p nas.techtales.io
  ```
Plan: 17 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```